Revit 2027 API
AssetProperty.GetTypeName Method
Get the name of the AssetProperty
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetTypeName(
	AssetPropertyType type
)
Public Shared Function GetTypeName (
	type As AssetPropertyType
) As String
public:
static String^ GetTypeName(
	AssetPropertyType type
)
static member GetTypeName :
        type : AssetPropertyType -> string
Parameters
type AssetPropertyType
Return Value
String
Exceptions
Exception | Condition
ArgumentException | Thrown when type is AssetPropertyType::Unknown.
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace